IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-LOOP.

DATA DIVISION.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
       PERFORM DISPLAY-REPEATED-TEXT 5 TIMES.
       STOP RUN.

DISPLAY-REPEATED-TEXT.
       DISPLAY 'This is repeated message.'.
