IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-LOOP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-COUNTER PIC 9(2).

PROCEDURE DIVISION.
       PERFORM DISPLAY-REPEATED-TEXT 5 TIMES.
       
       MOVE 10 TO MY-COUNTER.
       PERFORM DISPLAY-COUNTER UNTIL MY-COUNTER = 0.
       STOP RUN.

DISPLAY-REPEATED-TEXT.
       DISPLAY 'This is repeated message.'.

DISPLAY-COUNTER.
       DISPLAY 'My counter is ' MY-COUNTER.
       COMPUTE MY-COUNTER = MY-COUNTER - 1.
