IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-LOOP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 MY-COUNTER PIC 9(2).
01 ITERATOR PIC 9(2).

PROCEDURE DIVISION.
       PERFORM DISPLAY-REPEATED-TEXT 5 TIMES.

       MOVE 10 TO MY-COUNTER.
       PERFORM DISPLAY-COUNTER UNTIL MY-COUNTER = 0.

       PERFORM DISPLAY-ITERATOR VARYING ITERATOR FROM 1 BY 1 UNTIL ITERATOR > 10.
       STOP RUN.

DISPLAY-REPEATED-TEXT.
       DISPLAY 'This is repeated message.'.

DISPLAY-COUNTER.
       
       DISPLAY 'My counter is ' MY-COUNTER.
       COMPUTE MY-COUNTER = MY-COUNTER - 1.

DISPLAY-ITERATOR.
       DISPLAY 'Current iterator is at ' ITERATOR.
